; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v8 ?v2)
             (pred_3 ?v4 ?v5)
             (pred_4 ?v8 ?v5)
             (pred_1 ?v1 ?v8 )
	     (pred_7 ?v8)
             (pred_9 ?v12)
             (pred_2 ?v4)
             (pred_5 ?v5)
             (pred_12 ?v8)
             (pred_10 ?v4)
             (pred_8 ?v8)
             (pred_6 ))



(:action op_3
:parameters (?v3 ?v9 ?v10 ?v13)
:precondition (and (pred_9 ?v3) (pred_9 ?v9) (pred_2 ?v10) (pred_5 ?v13)
          (pred_11 ?v3 ?v9) (pred_3 ?v10 ?v13)
                   (pred_4 ?v9 ?v13) (pred_7 ?v3) 
                   (pred_12 ?v9) (pred_10 ?v10))
:effect (and  (pred_8 ?v9) (not (pred_12 ?v9))))


(:action op_1
:parameters (?v3 ?v6)
:precondition (and (pred_9 ?v3) (pred_9 ?v6)
               (pred_7 ?v3) (pred_11 ?v3 ?v6) (pred_8 ?v6))
:effect (and (pred_7 ?v6) (not (pred_7 ?v3))))

(:action op_4
:parameters (?v3 ?v10)
:precondition (and (pred_9 ?v3) (pred_2 ?v10) 
                  (pred_7 ?v3) (pred_1 ?v10 ?v3) (pred_6 ))
:effect (and (pred_10 ?v10)
   (not (pred_1 ?v10 ?v3)) (not (pred_6 ))))


(:action op_5
:parameters (?v3 ?v11 ?v7)
:precondition (and (pred_9 ?v3) (pred_2 ?v11) (pred_2 ?v7)
                  (pred_7 ?v3) (pred_10 ?v7) (pred_1 ?v11 ?v3))
:effect (and (pred_10 ?v11) (pred_1 ?v7 ?v3)
        (not (pred_10 ?v7)) (not (pred_1 ?v11 ?v3))))

(:action op_2
:parameters (?v3 ?v10)
:precondition (and (pred_9 ?v3) (pred_2 ?v10) 
                  (pred_7 ?v3) (pred_10 ?v10))
:effect (and (pred_6 ) (pred_1 ?v10 ?v3) (not (pred_10 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_21 obj_09 obj_14 obj_22 obj_17 obj_12 obj_15 obj_07 obj_11 obj_13 obj_01 obj_04 obj_18 obj_19 obj_06
    obj_02 obj_16 obj_05
    obj_20 obj_10 obj_03
    )

    (:init
       (pred_6)

       (pred_9 obj_08)
       (pred_9 obj_21)
       (pred_9 obj_09)
       (pred_9 obj_14)
       (pred_9 obj_22)
       (pred_9 obj_17)
       (pred_9 obj_12)
       (pred_9 obj_15)
       (pred_9 obj_07)
       (pred_9 obj_11)
       (pred_9 obj_13)
       (pred_9 obj_01)
       (pred_9 obj_04)
       (pred_9 obj_18)
       (pred_9 obj_19)
       (pred_9 obj_06)
       (pred_5 obj_02)
       (pred_5 obj_16)
       (pred_5 obj_05)
       (pred_2 obj_20)
       (pred_2 obj_10)
       (pred_2 obj_03)

       (pred_11 obj_08 obj_22)
       (pred_11 obj_08 obj_21)
       (pred_11 obj_21 obj_17)
       (pred_11 obj_21 obj_09)
       (pred_11 obj_21 obj_08)
       (pred_11 obj_09 obj_12)
       (pred_11 obj_09 obj_14)
       (pred_11 obj_09 obj_21)
       (pred_11 obj_14 obj_15)
       (pred_11 obj_14 obj_09)
       (pred_11 obj_22 obj_07)
       (pred_11 obj_22 obj_17)
       (pred_11 obj_22 obj_08)
       (pred_11 obj_17 obj_11)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_21)
       (pred_11 obj_17 obj_22)
       (pred_11 obj_12 obj_13)
       (pred_11 obj_12 obj_15)
       (pred_11 obj_12 obj_09)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_15 obj_01)
       (pred_11 obj_15 obj_14)
       (pred_11 obj_15 obj_12)
       (pred_11 obj_07 obj_04)
       (pred_11 obj_07 obj_11)
       (pred_11 obj_07 obj_22)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_13)
       (pred_11 obj_11 obj_17)
       (pred_11 obj_11 obj_07)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_13 obj_01)
       (pred_11 obj_13 obj_12)
       (pred_11 obj_13 obj_11)
       (pred_11 obj_01 obj_06)
       (pred_11 obj_01 obj_15)
       (pred_11 obj_01 obj_13)
       (pred_11 obj_04 obj_18)
       (pred_11 obj_04 obj_07)
       (pred_11 obj_18 obj_19)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_18 obj_04)
       (pred_11 obj_19 obj_06)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_18)
       (pred_11 obj_06 obj_01)
       (pred_11 obj_06 obj_19)
       (pred_12 obj_04)
       (pred_12 obj_17)
       (pred_12 obj_14)
       (pred_4  obj_04 obj_02)
       (pred_4  obj_17 obj_16)
       (pred_4  obj_14 obj_05)
       (pred_8 obj_08)
       (pred_8 obj_21)
       (pred_8 obj_09)
       (pred_8 obj_22)
       (pred_8 obj_12)
       (pred_8 obj_15)
       (pred_8 obj_07)
       (pred_8 obj_11)
       (pred_8 obj_13)
       (pred_8 obj_01)
       (pred_8 obj_18)
       (pred_8 obj_19)
       (pred_8 obj_06)

       (pred_3  obj_20 obj_02)
       (pred_3  obj_10 obj_16)
       (pred_3  obj_03 obj_05)
       (pred_1 obj_20 obj_11)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_03 obj_22)
       (pred_7 obj_08)
    )

    (:goal (and
       (pred_1 obj_10 obj_12)
       (pred_1 obj_03 obj_18)
    ))
(:constraints
  (always (not (pred_7 obj_13)))
)
)

; plan
1. (op_1 obj_08 obj_22)
   deleted: (pred_7 obj_08)
   added: (pred_7 obj_22)
   goals met: 0 of 2
2. (op_1 obj_22 obj_07)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_07)
   goals met: 0 of 2
3. (op_4 obj_07 obj_10)
   deleted: (pred_1 obj_10 obj_07) (pred_6)
   added: (pred_10 obj_10)
   goals met: 0 of 2
4. (op_1 obj_07 obj_22)
   deleted: (pred_7 obj_07)
   added: (pred_7 obj_22)
   goals met: 0 of 2
5. (op_3 obj_22 obj_17 obj_10 obj_16)
   deleted: (pred_12 obj_17)
   added: (pred_8 obj_17)
   goals met: 0 of 2
6. (op_1 obj_22 obj_17)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_17)
   goals met: 0 of 2
7. (op_1 obj_17 obj_12)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_12)
   goals met: 0 of 2
8. (op_2 obj_12 obj_10)
   deleted: (pred_10 obj_10)
   added: (pred_6) (pred_1 obj_10 obj_12)
   goals met: 1 of 2
9. (op_1 obj_12 obj_17)
   deleted: (pred_7 obj_12)
   added: (pred_7 obj_17)
   goals met: 1 of 2
10. (op_1 obj_17 obj_22)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_22)
   goals met: 1 of 2
11. (op_4 obj_22 obj_03)
   deleted: (pred_1 obj_03 obj_22) (pred_6)
   added: (pred_10 obj_03)
   goals met: 1 of 2
12. (op_1 obj_22 obj_17)
   deleted: (pred_7 obj_22)
   added: (pred_7 obj_17)
   goals met: 1 of 2
13. (op_1 obj_17 obj_11)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_11)
   goals met: 1 of 2
14. (op_1 obj_11 obj_18)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_18)
   goals met: 1 of 2
15. (op_2 obj_18 obj_03)
   deleted: (pred_10 obj_03)
   added: (pred_6) (pred_1 obj_03 obj_18)
   goals met: 2 of 2
